app/Models/User.php

    function get()
    {
        return $this->db->table($this->table)->get()->getResult('array');
---
SELECT *
FROM `users`

    function getId($id)
    {
        return $this->db->table($this->table)->where(['id' => $id])
            ->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '1'

    function checkUsername($username)
    {
        return $this->db->table($this->table)->where(['username' => $username])->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `username` = 'tst'

    function create($data)
    {
        return $this->db->table($this->table)->insert($data);
---
INSERT INTO `users` (`username`) VALUES ('tst')

    function patch($id, $data)
    {
        return $this->db->table($this->table)->update($data, ['id' => $id]);
---
UPDATE `users` SET `username` = 'bayuuuuuu'
WHERE `id` = '1'

    function destroy($id)
    {
        return $this->db->table($this->table)->delete(['id' => $id]);
---
DELETE FROM `users`
WHERE `id` = '3'